const texts = [
"Приймай життя як героїчний подвиг і здобувай чин незламної волі та творчої ідеї.",
" Найвищим Твоїм законом і Твоїм бажанням є воля й ідея Нації",
"Будь гідним виконавцем заповітів великих синів Твоєї Нації і борись та працюй для великого майбутнього",
"Твоїм найбільшим добром і Твоєю честю є сила і велич Твоєї Нації.",
"Залізна дисципліна супроти Ідеї та Проводу й обов'язок праці є Твоєю чеснотою.",
"Пам'ятай, що Україна покликана до творення нового життя і тому працюй для її мотутности й розвитку",
" Плекай духа волі й творчости, неси всюди ідею Правди України і закріплюй в життя її історичну місію.",
"Твоєю найбільшою любов'ю є Українська Нація, а Твоїми братами всі члени української національної спільноти.",
" Будь вірний Ідеї Нації на життя і смерть і не здайся, хоч би проти Тебе був увесь світ"
]
const btn = document.querySelector("#changeText");
btn.addEventListener("click", function () {
    let text
    currText = document.querySelector("#home-quotes").innerHTML
    do {
        text = texts[Math.round(Math.random() * (texts.length - 1))]
    } while (text === currText)
    document.querySelector("#home-quotes").innerHTML = text
});
